//Задание 8
//        Электронные часы показывают время в формате от 00:00
//        до 23:59. Написать программу, которая выведет на консоль
//        сколько раз за сутки случается так, что слева от двоеточия
//        показывается симметричная комбинация для той,
//        что справа от двоеточия (например, 02:20, 11:11 или 15:51). Вывести
//        на экран все симметричные комбинации. Вывести общее
//        число комбинаций.


public class Task_8 {
    public static void main(String[] args) {
        int hours = 0;
        int minuts = 0;
        while (hours < 24){
            hours
        }
    }
}
